# Taps
tap 'heroku/brew'

# Binaries
brew 'alacritty'
brew 'bat'
brew 'colordiff'
brew 'coreutils' # Those that come with macOS are outdated
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'git-delta'
brew 'git-lsp'
brew 'gitmoji'
brew 'gstreamer'
brew 'gst-plugins-base'
brew 'gst-plugins-good'
brew 'heroku'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jq'
brew 'lab'
brew 'less'
brew 'llvm'
brew 'loc'
brew 'lsd'
brew 'mas' # Mac App Store manager
brew 'noti'
brew 'nvim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'postgresql'
brew 'pre-commit'
brew 'pyenv'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'tldr'
brew 'tmux'
brew 'translate-shell'
brew 'tunnelblick'
brew 'wget'
brew 'zlib'
brew 'zoxide'

# Apps
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'mattermost'
cask 'ngrok'
cask 'rectangle'
cask 'spotify'
cask 'telegram'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
